cookj273/MODBUS/example/NRF52840/modbus_port.c
/*!
* @file modbus_port.c
* @author Jarrod Cook
*
* @brief Implementation of the board specific functionality for MODBUS
*
* This file is the implementation of routines to handle the UART output
* and timer implementation as well as function handlers for MODBUS. It is using an nrf52840, using both UART
* for RTU mode and using a WIZ610IO (https://www.wiznet.io/product-item/wiz610io/) to provide ethernet functionality!
*
* @copyright Copyright 2021 Matric Limited. Licensed under the MIT License. See LICENSE file in the project root for full license information.
*/

//Includes
#include "modbus_port.h"
#include "global.h"
#include "socket.h"
#include "timer.h"
#include "prs/nrfx_prs.h"
#include "nrf_drv_uart.h"
#include <nrfx_uart.h>
#include "app_timer.h"
#include "nrf_drv_clock.h"

//Defines
#define TCP_PORT_IDX(a) (a - MB_TCP_REDUND_PORT_NUM)

//Typedefs and Enums
typedef struct nrf_port_info_type {
    uint8_t port;
    nrfx_uart_t *uartReg;
    uint32_t appTimerTicks;
    bool waitOnLast;
    bool disableInt;
} nrf_port_info;

//Local Variables
static volatile bool inTimInterrupt = false;    //!< Tracks when we are in the timer interrupt to avoid disables
static volatile bool inUsartInterrupt = false;  //!< Tracks when we are in the Usart interrupt to avoid disables
uint16_t timeArr = 0;                           //!< Auto-reload value for the timer
void (*rxIntFunc)(uint8_t port);                //!< The Receive Callback function
void (*txIntFunc)(uint8_t port);                //!< The Transmit Callback function
void (*timeoutIntFunc)(uint8_t port);           //!< The Timeout Callback function
static bool sevenBit;
static nrf_port_info nrfPortInfo[NUM_MODBUS_PORTS] = {{0, NULL, 0, false, false}};

static int mbSocket[NUM_MB_TCP_PORTS] = {-1,-1};
static int mbPort[NUM_MB_TCP_PORTS] = {-1,-1};
static int mbSlave[NUM_MB_TCP_PORTS] = {-1,-1};
static int curSlave[NUM_MB_TCP_PORTS] = {-1,-1};
static bool tcpSend[NUM_MB_TCP_PORTS] = {false};
static uint32_t tcpTimer[NUM_MB_TCP_PORTS] = {0};
static modbus_device_types tcpDevType[NUM_MB_TCP_PORTS];
static uint16_t tcpTxStop[NUM_MB_TCP_PORTS] = {0}, tcpTxStart[NUM_MB_TCP_PORTS] = {0};
static uint8_t tcpTxBuf[NUM_MB_TCP_PORTS][MB_TCP_BUF_SIZE] = {0};
static uint16_t tcpRxStop[NUM_MB_TCP_PORTS] = {0}, tcpRxStart[NUM_MB_TCP_PORTS] = {0};
static uint8_t tcpRxBuf[NUM_MB_TCP_PORTS][MB_TCP_BUF_SIZE] = {0};

void (*rxTCPIntFunc[NUM_MB_TCP_PORTS])(uint8_t port);                //!< The Receive Callback function
void (*txTCPIntFunc[NUM_MB_TCP_PORTS])(uint8_t port);                //!< The Transmit Callback function
void (*timeoutTCPIntFunc[NUM_MB_TCP_PORTS])(uint8_t port);           //!< The Timeout Callback function

nrf_drv_uart_t uart_driver_instance = NRF_DRV_UART_INSTANCE(0);
APP_TIMER_DEF(m_modbus_timer);

static void uart_interrupts_enable(nrfx_uart_t const * p_instance)
{
    NVIC_EnableIRQ(nrfx_get_irq_number((void *)p_instance->p_reg));
}

static void uart_interrupts_disable(nrfx_uart_t const * p_instance)
{
    NVIC_DisableIRQ(nrfx_get_irq_number((void *)p_instance->p_reg));
}

/*
static void port_loopback_test(void) {
    LL_USART_Enable(MB_USART);
    LL_GPIO_ResetOutputPin(MB_RXEN_PIN_PORT, MB_RXEN_PIN_NUM);
    LL_USART_SetTransferDirection(MB_USART, LL_USART_DIRECTION_RX);

    char inChar = 0;
    while(1) {

        //Send character
        //If we have a character send it back
        while(LL_USART_IsActiveFlag_RXNE(MB_USART)) {
            //Get character
            inChar = LL_USART_ReceiveData8(MB_USART);

            //Disable Receive and enable transmit
            LL_GPIO_SetOutputPin(MB_RXEN_PIN_PORT, MB_RXEN_PIN_NUM);
            LL_USART_SetTransferDirection(MB_USART, LL_USART_DIRECTION_TX);

            //Send character
            LL_USART_TransmitData8(MB_USART, inChar);
            while(!LL_USART_IsActiveFlag_TC(MB_USART)) {

            }

            //Disable Transmit and enable receive
            LL_GPIO_ResetOutputPin(MB_RXEN_PIN_PORT, MB_RXEN_PIN_NUM);
            LL_USART_SetTransferDirection(MB_USART, LL_USART_DIRECTION_RX);
        }
    }
}
*/

void nrfx_uart_0_irq_handler(void)
{
    uint8_t port = MB_RTU_MASTER_PORT_NUM;

    inUsartInterrupt = true;
    if (nrf_uart_int_enable_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_ERROR) &&
            nrf_uart_event_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_ERROR)) {
        //Just clear, let more bytes come in and let timeout trigger end of bad packet to fresh start
        nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_ERROR);
    }

    if (nrf_uart_int_enable_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_RXDRDY) &&
            nrf_uart_event_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_RXDRDY)) {
        if(rxIntFunc) {
            rxIntFunc(port);
        } else {
            nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_RXDRDY);
            (void) nrf_uart_rxd_get(nrfPortInfo[port].uartReg->p_reg);
        }
    }

    if (nrf_uart_int_enable_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_TXDRDY) &&
            nrf_uart_event_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_TXDRDY)) {
        if(txIntFunc && !nrfPortInfo[port].waitOnLast) {
            txIntFunc(port);
        } else {
            nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_TXDRDY);
            nrf_uart_int_disable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_TXDRDY);
            if(nrfPortInfo[port].waitOnLast) {
                if(nrfPortInfo[port].appTimerTicks > 15) {
                    app_timer_start(m_modbus_timer, nrfPortInfo[port].appTimerTicks/3, &nrfPortInfo[port]);
                } else {
                    app_timer_start(m_modbus_timer, 5, &nrfPortInfo[port]);
                }
            }
        }
    }

    inUsartInterrupt = false;
}

/*!
* @brief Interrupt handler for modbus timer
*
* Used to determine timeout for packets which will indicate the end of a
* received packet.
*/
void timeout_handler(void * p_context)
{
    nrf_port_info *portInfo = (nrf_port_info *)p_context;

    if(nrfPortInfo[portInfo->port].disableInt) {
        //We are ignoring ints for now so call again soon
        app_timer_start(m_modbus_timer, 5, &nrfPortInfo[portInfo->port]);
    }

