cookj273/MODBUS/example/NRF52840/modbus_port.c
    inTimInterrupt = true;

    //Call our callback
    if(nrfPortInfo[portInfo->port].waitOnLast) {
        //We double-use this timer for our last TX byte as well
        nrfPortInfo[portInfo->port].waitOnLast = false;
        if(txIntFunc) {
            txIntFunc(portInfo->port);
        }
    } else if(timeoutIntFunc) {
        timeoutIntFunc(portInfo->port);
    }

    inTimInterrupt = false;
}

/*!
* @brief This function initializes the appropriate hardware to perform communications
*
* This function will initialize a hardware timer to determine packet timeout and ends
* as well as initializing the hardware modules and setup the medium on which to perform
* communications.  After initialization all ports and modules will be left in the disabled
* states.
*
* @param port The port to initialize
* @param baudRate The baud rate to use for communication
* @param charSize The character size to use in communication
* @param parity The parity to use for communication
* @param stopBits The number of stop bits to use in communication
* @param timeoutBits The number of bits that indicate the end of the frame
* @param rxCallback Function to call when a byte is received
* @param txCallback Function to call when a new transmit byte is needed
* @param timeoutCallback Function to call if a timeout occurs
*
* @return Boolean indicating success of port initialization
*/
bool modbus_port_init(uint8_t port, uint32_t baudRate, uint8_t charSize, modbus_parity parity, uint8_t stopBits, uint16_t timeoutBits,
                      void (*rxCallback)(uint8_t port), void (*txCallback)(uint8_t port), void (*timeoutCallback)(uint8_t port))
{
    int test, psc, mbTimeout;
    nrf_drv_uart_config_t config = NRF_DRV_UART_DEFAULT_CONFIG;

    //We only have one port!
    if((port != MB_RTU_SLAVE_PORT_NUM) && (port != MB_RTU_MASTER_PORT_NUM)) {
        return false;
    }

    //Char size > 8 we can't support if parity is on (9th bit needed for parity)
    sevenBit = false;
    if((charSize < 7) || ((charSize > 8) && (parity != MODBUS_PARITY_NONE)) || (charSize > 9)) {
        return false;
    } else if(stopBits != 1) {
        //This CPU only supports 1 stop bit
        return false;
    } else if(charSize == 7) {
        //The CPU can't support 7-bit mode so we have to use 2 stop bits and make our 8th bit a stop
        if(parity != MODBUS_PARITY_NONE) {
            return false;
        }
        stopBits = 2;
        sevenBit = true;
    }

    //Bind our callbacks
    rxIntFunc = rxCallback;
    txIntFunc = txCallback;
    timeoutIntFunc = timeoutCallback;

    //Init directional pin for half-duplex
    nrf_gpio_cfg_output(MB_RTU_DIR_PIN);
    nrf_gpio_pin_clear(MB_RTU_DIR_PIN);

    //Init Timer
    if(app_timer_create(&m_modbus_timer, APP_TIMER_MODE_SINGLE_SHOT, timeout_handler) != NRF_SUCCESS) {
        return false;
    }

    //Setup config and init uart
    nrfPortInfo[port].port = port;
    nrfPortInfo[port].uartReg = &(uart_driver_instance.uart);
    nrfPortInfo[port].waitOnLast = false;
    nrfPortInfo[port].appTimerTicks = (((int)timeoutBits * (((int)APP_TIMER_CLOCK_FREQ*100)/(int)baudRate))+90)/100; //Round up mostly (.1 or more)
    if(nrfPortInfo[port].appTimerTicks < 5) {
        nrfPortInfo[port].appTimerTicks = 5;
    }
    config.p_context = &nrfPortInfo[port];
    config.use_easy_dma = false;
    config.pseltxd  = MB_RTU_TX_PIN;
    config.pselrxd  = MB_RTU_RX_PIN;
    if(baudRate <= 1200) {
        config.baudrate = NRF_UART_BAUDRATE_1200;
    } else if(baudRate <= 2400) {
        config.baudrate = NRF_UART_BAUDRATE_2400;
    } else if(baudRate <= 4800) {
        config.baudrate = NRF_UART_BAUDRATE_4800;
    } else if(baudRate <= 9600) {
        config.baudrate = NRF_UART_BAUDRATE_9600;
    } else if(baudRate <= 14400) {
        config.baudrate = NRF_UART_BAUDRATE_14400;
    } else if(baudRate <= 19200) {
        config.baudrate = NRF_UART_BAUDRATE_19200;
    } else if(baudRate <= 28800) {
        config.baudrate = NRF_UART_BAUDRATE_28800;
    } else if(baudRate <= 31250) {
        config.baudrate = NRF_UART_BAUDRATE_31250;
    } else if(baudRate <= 38400) {
        config.baudrate = NRF_UART_BAUDRATE_38400;
    } else if(baudRate <= 56000) {
        config.baudrate = NRF_UART_BAUDRATE_56000;
    } else if(baudRate <= 57600) {
        config.baudrate = NRF_UART_BAUDRATE_57600;
    } else if(baudRate <= 76800) {
        config.baudrate = NRF_UART_BAUDRATE_76800;
    } else if(baudRate <= 115200) {
        config.baudrate = NRF_UART_BAUDRATE_115200;
    } else if(baudRate <= 230400) {
        config.baudrate = NRF_UART_BAUDRATE_230400;
    } else if(baudRate <= 250000) {
        config.baudrate = NRF_UART_BAUDRATE_250000;
    } else if(baudRate <= 460800) {
        config.baudrate = NRF_UART_BAUDRATE_460800;
    } else if(baudRate <= 921600) {
        config.baudrate = NRF_UART_BAUDRATE_921600;
    } else {
        config.baudrate = NRF_UART_BAUDRATE_1000000;
    }

#if NRFX_CHECK(NRFX_PRS_ENABLED)
    static nrfx_irq_handler_t const irq_handlers[NRFX_UART_ENABLED_COUNT] = {
#if NRFX_CHECK(NRFX_UART0_ENABLED)
        nrfx_uart_0_irq_handler,
#endif
    };

    if (nrfx_prs_acquire(nrfPortInfo[port].uartReg->p_reg, irq_handlers[nrfPortInfo[port].uartReg->drv_inst_idx]) != NRFX_SUCCESS) {
        return false;
    }
#endif // NRFX_CHECK(NRFX_PRS_ENABLED)

    //Setup and Initialize
    nrf_gpio_pin_set(config.pseltxd);
    nrf_gpio_cfg_output(config.pseltxd);
    nrf_gpio_cfg_input(config.pselrxd, NRF_GPIO_PIN_NOPULL);
    nrf_uart_baudrate_set(nrfPortInfo[port].uartReg->p_reg, config.baudrate);
    nrf_uart_configure(nrfPortInfo[port].uartReg->p_reg, config.parity, config.hwfc);
    nrf_uart_txrx_pins_set(nrfPortInfo[port].uartReg->p_reg, config.pseltxd, config.pselrxd);

    //Turn interttupts on but disable
    nrf_uart_int_disable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_RXDRDY | NRF_UART_INT_MASK_ERROR | NRF_UART_INT_MASK_TXDRDY | NRF_UART_INT_MASK_RXTO);
    NRFX_IRQ_PRIORITY_SET(nrfx_get_irq_number((void *)nrfPortInfo[port].uartReg->p_reg), config.interrupt_priority);
    NRFX_IRQ_ENABLE(nrfx_get_irq_number((void *)nrfPortInfo[port].uartReg->p_reg));

    //Enable the UART
    nrf_uart_enable(nrfPortInfo[port].uartReg->p_reg);

    //Start disabled
    modbus_port_serial_enable(port, false, false);

