cookj273/MODBUS/example/NRF52840/modbus_port.c
    return true;
}

/*!
* @brief This function enables the serial port as desired for proper communication
*
* This function will set the enable/disable status of the rx and tx lines
* to their appropriate values for communicating.  They are present as 2
* values mostly for the ability to disable both and gain the power savings
* of the chip progressing into low power mode.
*
* @param port The port to perform enables on
* @param rxEnable True will enable receiving on the port
* @param txEnable True will enable transmitting on the port
*
* @return Boolean indicating success of port initialization
*/
void modbus_port_serial_enable(uint8_t port, bool rxEnable, bool txEnable)
{
    //We only have one port, if not it then abort
    if((port != MB_RTU_SLAVE_PORT_NUM) && (port != MB_RTU_MASTER_PORT_NUM)) {
        return;
    }

    //Stop our timer and disable interrupts
    app_timer_stop(m_modbus_timer);
    uart_interrupts_disable(nrfPortInfo[port].uartReg);
    nrfPortInfo[port].disableInt = true;

    //Enable or disable receiving
    if(rxEnable) {
        //Disable driver out
        nrf_gpio_pin_clear(MB_RTU_DIR_PIN);

        app_timer_start(m_modbus_timer, nrfPortInfo[port].appTimerTicks, &nrfPortInfo[port]);

        nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_ERROR);
        nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_RXDRDY);
        nrf_uart_int_enable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_RXDRDY | NRF_UART_INT_MASK_ERROR);
        nrf_uart_task_trigger(nrfPortInfo[port].uartReg->p_reg, NRF_UART_TASK_STARTRX);

    } else {
        nrf_uart_int_disable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_RXDRDY | NRF_UART_INT_MASK_ERROR);
        nrf_uart_task_trigger(nrfPortInfo[port].uartReg->p_reg, NRF_UART_TASK_STOPRX);
    }

    //Enable or disable transmitting
    if(txEnable && !rxEnable) {
        //Enable driver out
        nrf_gpio_pin_set(MB_RTU_DIR_PIN);

        nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_TXDRDY);
        nrf_uart_task_trigger(nrfPortInfo[port].uartReg->p_reg, NRF_UART_TASK_STARTTX);
        nrf_uart_int_enable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_TXDRDY);

        //Prime the first byte
        if(txIntFunc) {
            txIntFunc(port);
        }
    } else {
        nrfPortInfo[port].waitOnLast = false;
        nrf_uart_int_disable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_TXDRDY);
        nrf_uart_task_trigger(nrfPortInfo[port].uartReg->p_reg, NRF_UART_TASK_STOPTX);
    }

    nrfPortInfo[port].disableInt = false;
    uart_interrupts_enable(nrfPortInfo[port].uartReg);
}

/*!
* @brief This function completely closes out the port
*
* This function is used in case we decide to stop using MODBUS.  It will
* completely deinitialize the module and shut it off to save power.
*
* @param port The port to close down
*/
void modbus_port_serial_close(uint8_t port)
{
    //We only have one port, so if not it then abort
    if(port >= NUM_MODBUS_PORTS) {
        return;
    }

    if((port == MB_TCP_REDUND_PORT_NUM) || (port == MB_TCP_COMMS_PORT_NUM)) {
        disconnect(mbSocket[TCP_PORT_IDX(port)]);
    } else {
        app_timer_stop(m_modbus_timer);
        nrf_uart_int_disable(nrfPortInfo[port].uartReg->p_reg, NRF_UART_INT_MASK_RXDRDY | NRF_UART_INT_MASK_TXDRDY | NRF_UART_INT_MASK_ERROR  | NRF_UART_INT_MASK_RXTO);
        NRFX_IRQ_DISABLE(nrfx_get_irq_number((void *)nrfPortInfo[port].uartReg->p_reg));
        nrf_uart_disable(nrfPortInfo[port].uartReg->p_reg);
        nrf_gpio_cfg_default(MB_RTU_TX_PIN);
        nrf_gpio_cfg_default(MB_RTU_RX_PIN);
#if NRFX_CHECK(NRFX_PRS_ENABLED)
        nrfx_prs_release(nrfPortInfo[port].uartReg->p_reg);
#endif
    }
}

/*!
* @brief This function changes the TX interrupt to fire when transfer is complete
*
* After queueing up the last byte to transfer this function should be called
* so that the next interrupt only occurs when the transfer is completely
* finished.  That way we don't disable transmitting too early.
*
* @param port The port to change the state of
*/
void modbus_port_notify_of_tx_completion(uint8_t port)
{
    //We only have one port, so if not it then abort
    if(port >= NUM_MODBUS_PORTS) {
        return;
    }

    if((port == MB_TCP_REDUND_PORT_NUM) || (port == MB_TCP_COMMS_PORT_NUM)) {
        tcpSend[TCP_PORT_IDX(port)] = true;
    } else {
        //Set a flag so the interrupt knows to start a timer for last byte
        nrfPortInfo[port].waitOnLast = true;
    }
}

/*!
* @brief This function will disable/enable the modbus interrupts
*
* This function will both enable and disable the interrupts for modbus.
* this allows interrupts to be disabled for critical sections to prevent
* race conditions.
*
* @param port The port to set enable status of interrupts for
* @param enable True will cause interrupts to be enabled and false disabled
*/
void modbus_port_enable_interrupts(uint8_t port, bool enable)
{
    //We only have one port, so if not it then abort
    if((port != MB_RTU_SLAVE_PORT_NUM) && (port != MB_RTU_MASTER_PORT_NUM)) {
        return;
    }

    //Since all functionality is within the UART interrupt then don't bother
    //disabling if we are in the interrupt routine.
    if(!inUsartInterrupt && !inTimInterrupt && enable) {
        uart_interrupts_enable(nrfPortInfo[port].uartReg);
        nrfPortInfo[port].disableInt = false;
    } else if(!inUsartInterrupt && !inTimInterrupt) {
        uart_interrupts_disable(nrfPortInfo[port].uartReg);
        nrfPortInfo[port].disableInt = true;
    }
}

/*!
* @brief This writes a byte to the port
*
* This function will write the given byte to the port to be sent out and
* immediately return.  Transmission complete will be denoted by an interrupt.
*
* @param port The port to send the byte over
* @param sndByte The byte to send
*
* @return Boolean indicating if the write was successful
*/
bool modbus_port_put_byte(uint8_t port, uint8_t sndByte)
{
    //We only have one port, so if not it then abort
    if(port >= NUM_MODBUS_PORTS) {
        return false;
    }

    if((port == MB_TCP_REDUND_PORT_NUM) || (port == MB_TCP_COMMS_PORT_NUM)) {
        if((tcpTxStop[TCP_PORT_IDX(port)] != (tcpTxStart[TCP_PORT_IDX(port)]-1)) && ((tcpTxStop[TCP_PORT_IDX(port)] != (sizeof(tcpTxBuf[TCP_PORT_IDX(port)])-1)) || (tcpTxStart[TCP_PORT_IDX(port)] != 0))) {
            tcpTxBuf[TCP_PORT_IDX(port)][tcpTxStop[TCP_PORT_IDX(port)]++] = sndByte;
            if(tcpTxStop[TCP_PORT_IDX(port)] >= sizeof(tcpTxBuf[TCP_PORT_IDX(port)])) {
                tcpTxStop[TCP_PORT_IDX(port)] = 0;
            }
            if((tcpTxStop[TCP_PORT_IDX(port)] == (tcpTxStart[TCP_PORT_IDX(port)]-1)) || ((tcpTxStop[TCP_PORT_IDX(port)] == (sizeof(tcpTxBuf[TCP_PORT_IDX(port)])-1)) && (tcpTxStart[TCP_PORT_IDX(port)] == 0))) {
                tcpSend[TCP_PORT_IDX(port)] = true;
            }
        } else {

