cookj273/MODBUS/example/NRF52840/modbus_port.c
        }
    } else {
        nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_TXDRDY);
        nrf_uart_txd_set(nrfPortInfo[port].uartReg->p_reg, (sevenBit?(0x80 | sndByte):sndByte));
        return true;
    }

    return false;
}

/*!
* @brief This reads a byte from the port
*
* This function will read a byte from the port if one exists.  If none exists
* or an error has occurred a false will be returned.
*
* @param port The port to get the byte on
* @param getByte Pointer to place the retrieved byte in
*
* @return Boolean indicating if a byte was successfully received and read.
*/
bool modbus_port_get_byte(uint8_t port, uint8_t *getByte)
{
    //We only have one port, so if not it abort
    if(port >= NUM_MODBUS_PORTS) {
        return false;
    }

    if((port == MB_TCP_REDUND_PORT_NUM) || (port == MB_TCP_COMMS_PORT_NUM)) {
        if(tcpRxStart[TCP_PORT_IDX(port)] != tcpRxStop[TCP_PORT_IDX(port)]) {
            *getByte = tcpRxBuf[TCP_PORT_IDX(port)][tcpRxStart[TCP_PORT_IDX(port)]++];
            if(tcpRxStart[TCP_PORT_IDX(port)] >= sizeof(tcpRxBuf[TCP_PORT_IDX(port)])) {
                tcpRxStart[TCP_PORT_IDX(port)] = 0;
            }
            return true;
        }
    } else {
        if(nrf_uart_event_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_ERROR)) {
            //Just clear, let more bytes come in and let timeout trigger end of bad packet to fresh start
            nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_ERROR);
        }
        if(nrf_uart_event_check(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_RXDRDY)) {
            nrf_uart_event_clear(nrfPortInfo[port].uartReg->p_reg, NRF_UART_EVENT_RXDRDY);
            *getByte = nrf_uart_rxd_get(nrfPortInfo[port].uartReg->p_reg);
            //If seven-bit it means the last bit is our stop bit we need to mask off
            if(sevenBit) {
                *getByte &= 0x7F;
            }
            return true;
        }
    }
    return false;
}

/*!
* @brief This enables/disables the timer to detect frame ends
*
* This function will both enable and disable the frame timer.  Sending the
* enable command will reset the timer to 0 and start it.  Upon reaching the
* set value it will fire an interrupt.  Calling disable will immediately
* disable the timer and clear any pending interrupts.
*
* @param port the port to enable the timer on
* @param enable True will enable, reset, and start timer and false will disable
*/
void modbus_port_timer_enable(uint8_t port, bool enable)
{
    //We only have one port if not it abort
    if(port >= NUM_MODBUS_PORTS) {
        return;
    }

    if((port == MB_TCP_REDUND_PORT_NUM) || (port == MB_TCP_COMMS_PORT_NUM)) {
        if(enable) {
            tcpTimer[TCP_PORT_IDX(port)] = get_msec_tick();
        } else {
            tcpTimer[TCP_PORT_IDX(port)] = 0;
        }
    } else {
        //Enable or disable as requested
        if(enable) {
            //Even if already enabled reset the count here
            app_timer_stop(m_modbus_timer);
            app_timer_start(m_modbus_timer, nrfPortInfo[port].appTimerTicks, &nrfPortInfo[port]);
        } else {
            app_timer_stop(m_modbus_timer);
        }
    }
}

bool modbus_port_tcp_init(uint8_t modPort, uint16_t tcpPort, uint16_t timeoutSec, modbus_device_types deviceType,
                          void (*rxCallback)(uint8_t port), void (*txCallback)(uint8_t port), void (*timeoutCallback)(uint8_t port))
{
    if((modPort != MB_TCP_REDUND_PORT_NUM) && (modPort != MB_TCP_COMMS_PORT_NUM)) {
        return false;
    }

    //Bind our callbacks
    rxTCPIntFunc[TCP_PORT_IDX(modPort)] = rxCallback;
    txTCPIntFunc[TCP_PORT_IDX(modPort)] = txCallback;
    timeoutTCPIntFunc[TCP_PORT_IDX(modPort)] = timeoutCallback;

    if(tcpPort != 0) {
        mbPort[TCP_PORT_IDX(modPort)] = (unsigned short)tcpPort;
    } else {
        mbPort[TCP_PORT_IDX(modPort)] = MB_TCP_DEFAULT_PORT;
    }

    tcpSend[TCP_PORT_IDX(modPort)] = false;
    mbSocket[TCP_PORT_IDX(modPort)] = (modPort == MB_TCP_REDUND_PORT_NUM)?SOCK_MODBUS_REDUND:SOCK_MODBUS_COMMS;
    tcpDevType[TCP_PORT_IDX(modPort)] = deviceType;

    return true;
}

uint16_t tcp_buf_space_left(uint16_t bufSize, uint16_t bufStart, uint16_t bufStop)
{
    if((bufStop == (bufStart-1)) || ((bufStop == (bufSize -1)) && (bufStart == 0))) {
        return 0;
    } else if(bufStop < bufStart) {
        return (bufStart-bufStop-1);
    } else {
        return (bufSize - bufStop) + (bufStart)-1;
    }
}

void modbus_tcp_connection_FSM(unit_settings *settings, unit_state *state)
{
    uint16_t len;
    uint32_t gettime = 0;
    uint16_t idx, numRec;
    bool connecting[NUM_MB_TCP_PORTS] = {false};
    uint8_t curState;

    for(idx = MB_TCP_REDUND_PORT_NUM; idx <= MB_TCP_COMMS_PORT_NUM; idx++) {
        if(mbPort[TCP_PORT_IDX(idx)] >= 0) {
            if((curState = getSn_SR(mbSocket[TCP_PORT_IDX(idx)])) != SOCK_INIT) {
                connecting[TCP_PORT_IDX(idx)] = false;
            }
            switch(curState) {
            case SOCK_ESTABLISHED:
                // Interrupt clear
                if(getSn_IR(mbSocket[TCP_PORT_IDX(idx)]) & Sn_IR_CON) {
                    setSn_IR(mbSocket[TCP_PORT_IDX(idx)], Sn_IR_CON);
                }

                //Handle any received data
                if ((len = getSn_RX_RSR(mbSocket[TCP_PORT_IDX(idx)])) > 0) {
                    if (len > tcp_buf_space_left(sizeof(tcpRxBuf[TCP_PORT_IDX(idx)]), tcpRxStart[TCP_PORT_IDX(idx)], tcpRxStop[TCP_PORT_IDX(idx)])) {
                        len = tcp_buf_space_left(sizeof(tcpRxBuf[TCP_PORT_IDX(idx)]), tcpRxStart[TCP_PORT_IDX(idx)], tcpRxStop[TCP_PORT_IDX(idx)]);
                    }

                    do {
                        if(len > (sizeof(tcpRxBuf[TCP_PORT_IDX(idx)]) - tcpRxStop[TCP_PORT_IDX(idx)])) {
                            numRec = recv(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpRxBuf[TCP_PORT_IDX(idx)][tcpRxStop[TCP_PORT_IDX(idx)]]), (sizeof(tcpRxBuf[TCP_PORT_IDX(idx)]) - tcpRxStop[TCP_PORT_IDX(idx)]));
                        } else {
                            numRec = recv(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpRxBuf[TCP_PORT_IDX(idx)][tcpRxStop[TCP_PORT_IDX(idx)]]), len);
                        }
                        len -= numRec;
                        tcpRxStop[TCP_PORT_IDX(idx)] += numRec;
                        if(tcpRxStop[TCP_PORT_IDX(idx)] >= sizeof(tcpRxBuf[TCP_PORT_IDX(idx)])) {
                            tcpRxStop[TCP_PORT_IDX(idx)] -= sizeof(tcpRxBuf[TCP_PORT_IDX(idx)]);
                        }
                    } while(len > 0);
                }

                //Handle sending any data
                if(tcpSend[TCP_PORT_IDX(idx)]) {
                    if((tcpDevType[TCP_PORT_IDX(idx)] == MODBUS_MASTER_DEVICE) && (mbSlave[TCP_PORT_IDX(idx)] != curSlave[TCP_PORT_IDX(idx)])) {
                        disconnect(mbSocket[TCP_PORT_IDX(idx)]);
                    } else {
                        if(tcpTxStart[TCP_PORT_IDX(idx)] < tcpTxStop[TCP_PORT_IDX(idx)]) {
                            if(tcpTxStop[TCP_PORT_IDX(idx)] - tcpTxStart[TCP_PORT_IDX(idx)] < 256) {
                                send(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpTxBuf[TCP_PORT_IDX(idx)][tcpTxStart[TCP_PORT_IDX(idx)]]), (tcpTxStop[TCP_PORT_IDX(idx)] - tcpTxStart[TCP_PORT_IDX(idx)]));
                                tcpTxStart[TCP_PORT_IDX(idx)] = tcpTxStop[TCP_PORT_IDX(idx)];
                                tcpSend[TCP_PORT_IDX(idx)] = false;
                            } else {
                                send(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpTxBuf[TCP_PORT_IDX(idx)][tcpTxStart[TCP_PORT_IDX(idx)]]), 255);
                                tcpTxStart[TCP_PORT_IDX(idx)] += 255;
                            }
                        } else if(tcpTxStart[TCP_PORT_IDX(idx)] > tcpTxStop[TCP_PORT_IDX(idx)]) {
                            if(sizeof(tcpTxBuf[TCP_PORT_IDX(idx)]) - tcpTxStart[TCP_PORT_IDX(idx)] < 256) {
                                send(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpTxBuf[TCP_PORT_IDX(idx)][tcpTxStart[TCP_PORT_IDX(idx)]]), (sizeof(tcpTxBuf[TCP_PORT_IDX(idx)]) - tcpTxStart[TCP_PORT_IDX(idx)]));
                                tcpTxStart[TCP_PORT_IDX(idx)] = 0;
                            } else {
                                send(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(tcpTxBuf[TCP_PORT_IDX(idx)][tcpTxStart[TCP_PORT_IDX(idx)]]), 255);
                                tcpTxStart[TCP_PORT_IDX(idx)] += 255;
                            }
                        } else {
                            tcpSend[TCP_PORT_IDX(idx)] = false;
                        }
                    }
                }
                break;
            case SOCK_CLOSE_WAIT:
                disconnect(mbSocket[TCP_PORT_IDX(idx)]);
                break;
            case SOCK_CLOSED:
                socket(mbSocket[TCP_PORT_IDX(idx)], Sn_MR_TCP4, mbPort[TCP_PORT_IDX(idx)], SF_IO_NONBLOCK);
                break;
            case SOCK_INIT:
                //Master actively connects and slave listens
                if(connecting[TCP_PORT_IDX(idx)]) {
                    //Check for timeout
                    if (getSn_IR(mbSocket[TCP_PORT_IDX(idx)]) & Sn_IR_TIMEOUT) {
                        setSn_IRCLR(TCP_PORT_IDX(idx), Sn_IR_TIMEOUT);
                        connecting[TCP_PORT_IDX(idx)] = false;
                    }
                } else if(tcpDevType[TCP_PORT_IDX(idx)] == MODBUS_MASTER_DEVICE) {
                    if(tcpSend[TCP_PORT_IDX(idx)]) {
                        curSlave[TCP_PORT_IDX(idx)] = mbSlave[TCP_PORT_IDX(idx)];
                        if(curSlave[TCP_PORT_IDX(idx)] == 1) {
                            if(connect(mbSocket[TCP_PORT_IDX(idx)], (uint8_t *)&(settings->ethSettings[ETHERNET_SET_PARTNER_MMSB]), mbPort[TCP_PORT_IDX(idx)], 4) == SOCK_BUSY) {
                                connecting[TCP_PORT_IDX(idx)] = true;
                            }
                        }
                    }
                } else {
                    listen(mbSocket[TCP_PORT_IDX(idx)]);
                }
                break;
            case SOCK_LISTEN:
                break;
            default :
                break;
            }

            //Flag receival
            if((tcpRxStart[TCP_PORT_IDX(idx)] != tcpRxStop[TCP_PORT_IDX(idx)]) && (rxTCPIntFunc[TCP_PORT_IDX(idx)] != NULL)) {
                rxTCPIntFunc[TCP_PORT_IDX(idx)](idx);
            }

            //Prime transmit
            if(!tcpSend[TCP_PORT_IDX(idx)] && (tcpTxStop[TCP_PORT_IDX(idx)] != (tcpTxStart[TCP_PORT_IDX(idx)] - 1)) && ((tcpTxStop[TCP_PORT_IDX(idx)] != (sizeof(tcpTxBuf[TCP_PORT_IDX(idx)]) - 1)) || (tcpTxStart[TCP_PORT_IDX(idx)] != 0)) && (txTCPIntFunc[TCP_PORT_IDX(idx)] != NULL)) {
                txTCPIntFunc[TCP_PORT_IDX(idx)](idx);
            }

            //Check for timeouts
            if((tcpTimer[TCP_PORT_IDX(idx)] != 0) && ((get_msec_tick() - tcpTimer[TCP_PORT_IDX(idx)]) > 1000)) {
                if(timeoutTCPIntFunc[TCP_PORT_IDX(idx)] != NULL) {
                    timeoutTCPIntFunc[TCP_PORT_IDX(idx)](idx);
                    tcpTimer[TCP_PORT_IDX(idx)] = 0;
                }
            }
        }
    }
}

void modbus_tcp_set_tx_slave(uint8_t port, uint8_t slaveAddress)
{
    if((port != MB_TCP_REDUND_PORT_NUM) && (port != MB_TCP_COMMS_PORT_NUM)) {
        return;
    }

    mbSlave[TCP_PORT_IDX(port)] = slaveAddress;
}
